package internal

import (
	"math/rand"
	"time"
)

var slavicCatsNames = []string{
	"Гладислав",
	"Кусимир",
	"Вездессун",
	"Вкусеслав",
	"Куселют",
	"Пузеслав",
	"Хвостосмысл",
	"Кусихвост",
	"Медолап",
	"Мясополк",
	"Жирополк",
	"Мечижор",
	"Шерстиком",
	"Ярожор",
	"Ярокус",
	"Яроцап",
	"Наглохват",
	"Лютодрав",
	"Мурополк",
	"Гадислав",
	"Вуглусрат",
	"Нагломорд",
	"Пузослав",
	"Мстиссав",
	"Мстикусь",
	"Вночискок",
	"Шерстоплюй",
	"Шерсторыг",
	"Прыгнарук",
	"Чешипуз",
	"Любомур",
	"Ногохват",
	"Мышебор",
	"Шерстемир",
	"Ночеблуд",
	"Всепожрал",
	"Фаршеяд",
	"Чопринес",
	"Мятанюх",
	"Когтетык",
	"Всесвалюн",
	"Глазосверк",
}

var r = rand.New(rand.NewSource(time.Now().UnixNano()))

func GetSlavicCatName() string {
	return slavicCatsNames[r.Int()%len(slavicCatsNames)]
}
